import helper_func as hf

def start_menu() -> None:
    '''Функция, которая отображет меню'''

    print('''
    =============================
    1. Ввести данные.
    2. Выполнить алгоритм.
    3. Вывести результат.
    0. Завершение работы прграммы.
    =============================
    ''')


def crypto(string: str, shift: int) -> str:
    '''Функция, которая реализует аглоритм шифра Виженера'''    
    
    print("Начало алгоритма...")
    print("Алгоритм завершил работу")
    
    return 'crypto-string'

def input_params():
    '''Функция, которая принимает исходные данные'''
    
    input("Введите данные: ")
    print("Данные были введены!")
    
def generating_params():
    '''Функция, которая генерирует значения случайным образом'''

    print(('generation_string', 7))
    

def result():
    '''Функция, которая вывод результат'''
    
    print('result')