def start_menu() -> None:
    '''Функция, которая отображет меню'''

    menu = '''
    =============================
    1. Ввести данные.
    2. Выполнить алгоритм.
    3. Вывести результат.
    0. Завершение работы прграммы.
    =============================
    '''
    print(menu)


def crypto(string: str, shift: int) -> str:
    '''Функция, которая реализует аглоритм шифра Виженера'''    
    print("Начало алгоритма...")
    print("Алгоритм ")
    return 'crypro_string'

def input_params() -> tuple[str, int]:
    '''Функция, которая принимает исходные данные'''
    
    input("Введите данные: ")
    print("Данные были введены!")
    return ('string', 1)
    

def generating_params() -> tuple[str, str]:
    '''Функция, которая генерирует значения случайным образом'''

    return ('string', 2)
    

def result(string: str) -> None:
    '''Функция, которая вывод результат'''
    
    print('crypto_string')